# 3. Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.

# РЕШЕНИЕ 1: ==========================================================================================================================

# str1 = input('Введите первую строку: ')
# str2 = input('Введите вторую строку: ')
# print(str1.count(str2) or str2.count(str1))

# РЕШЕНИЕ 2: ==========================================================================================================================

# str1 = input('Введите первую строку: ')
# str2 = input('Введите вторую строку: ')
# c = 0
# for i in range(len(str1) - len(str2) + 1):
#     if str1[i:i + len(str2)] == str2:
#         c += 1
# print(c)

# РЕШЕНИЕ 3: ==========================================================================================================================

# s1 = input('Введите первую строку: ')
# s2 = input('Введите вторую строку: ') 
# if s1 < s2:
#     s2, s1 = s1, s2
# ind = 0
# c = 0
# while ind < len(s1):
#     if s1[ind: ind + len(s2)] == s2:
#         c += 1
#         ind += len(s2)
#     else:
#         ind+= 1
# print(c)